Repository: AladdineDev/portfolio
Catalog: lib/src/localization/app_*.arb
Languages: fr

# name
source: Aladdine Abdou
fr: Tolulope Christopher Olaniyan

# homeSectionTitle
source: Home
fr: Accueil

# aboutSectionTitle
source: About
fr: À propos

# aboutSectionTitleAlt
source: About Me
fr: À propos de moi

# experienceSectionTitle
source: Experience
fr: Expériences

# projectsSectionTitle
source: Projects
fr: Projets

# englishLanguage
source: English
fr: Anglais

# frenchLanguage
source: French
fr: Français

source: Resume
fr: CV

source: Download resume
fr: Télécharger le CV

# resumePresent
source: Present
fr: Présent

# description
source: Software Imagineer
fr: Développeur Imagineer

# subDescription
source: Flutter Enthusiast
fr: Passionné de Flutter

# about
source: Hello! I'm Aladdine, an apprentice developer and third-year student at ESGI Paris, specializing in mobile and IoT development. Passionate about the mobile ecosystem, I combine my studies with my practical expericence to build intuitive and feature-rich applications. I aspire to put my skills to work on inspiring and challenging projects.
fr: Bonjour ! Je m'appelle Aladdine, et je suis apprenti développeur en troisième année de Mobilité et Objets Connectés à l'ESGI Paris. Passionné par l'écosystème mobile, je combine mes études et mon expérience professionnelle pour créer des applications intuitives et riches en fonctionnalités. J'aspire à mettre mes compétences au service de projets inspirants et challengeant.

# mobileDevJobTitle
source: Mobile Developer
fr: Développeur Mobile

# mobileWebDevJobTitle
source: Mobile Web Developer
fr: Développeur Web Mobile

# webDevJobTitle
source: Web Developer
fr: Développeur Web

# wdiJobDescription
source: Development of an offline-first mobile snagging application for Disneyland Paris, streamlining information gathering for technical experts in the field and enhancing communication with maintenance services for problem-solving.
fr: Développement d'une application mobile offline-first de levée des réserves pour Disneyland Paris, facilitant la collecte d'informations pour les experts techniques sur le terrain et améliorant la communication avec les services de maintenance pour la résolution des problèmes.

# smtJobDescription
source: Development of a Progressive Web App for security systems technicians, that allows them to generate comprehensive quotes in PDF format including photos. This enables immediate delivery of quotes to customers after the visit.
fr: Développement d'une Progressive Web App à destination des techniciens en systèmes de sécurité, leur permettant de générer des devis complets au format PDF en y incluant des photos. Cela permet de délivrer les devis aux clients immédiatement après la visite.

# faireJobDescription
source: Development of the association's website, in collaboration with a group of developers. It provides visitors with the opportunity to learn more about the association and become members. To date, the website has attracted over 10,000 visits.
fr: Développement du site web de l'association, en collaboration au sein d'un groupe de développeurs. Ce site web offre à ses visiteurs la possibilité d'en savoir plus sur l'association et de la rejoindre en tant que membres. À ce jour, le site web a attiré plus de 10 000 visites.

# portfolioDescription
source: Yes, it's THIS portfolio! This project follows a Riverpod-based Architecture, using a feature-first approach for its structure. It is fully responsive, and supports multiple themes and languages.
fr: Oui, il s'agit de CE portfolio ! Ce projet adopte une architecture basée sur Riverpod en suivant une approche orientée fonctionnalités pour sa structure. Il est entièrement responsive, et prend en charge plusieurs thèmes ainsi que plusieurs langues.

# learnFlowApiDescription
source: Learn Flow is a collaborative project focused on creating a solution that connects students and teachers. This REST API serves as an interface for the project's various clients, including Android, iOS, and Web. It notably offers authentication capabilities (JWT).
fr: Learn Flow est un projet de groupe visant à créer une solution de mise en relation d'élèves et d'enseignants. Cette API REST sert d'interface pour les différents clients du projet (Android, iOS et Web). Elle offre notamment des fonctionnalités d'authentification (JWT).

# learnFlowBackOfficeDescription
source: This is the back-office build for managers in the Learn Flow project. This Single-Page App enables them to monitor activity such as user traffic and invoices associated with their applications and users.
fr: Il s'agit du back-office conçu pour les managers du projet Learn Flow. Cette Single-Page App leur permet de surveiller l'activité de leurs applications et utilisateurs (trafic, factures...).

# gsbFraisDescription
source: The GSB-Frais project is a web-based expense management application developed for medical representatives and accountants at the fictional company GSB. It facilitates the entry and review of monthly reports by medical representatives, while enabling accountants to process them.
fr: GSB-Frais est une application web de gestion des frais, développée pour les délégués médicaux et les comptables de l'entreprise fictive GSB. Elle facilite la saisie et la vérification des rapports mensuels des délégués médicaux, tout en permettant aux comptables de les traiter.

# gsbRvVisiteurServeurDescription
source: The GSB project's REST API serves as an interface for various project clients, including Android, Desktop, and Web applications.
fr: L'API REST du projet GSB sert d'interface pour les différents clients du projet (Android, Desktop et Web).

# gsbRvDr
source: The GSB-RV-DR project is a desktop application designed for regional delegates at the fictional company GSB. It tracks visit reports and enables monitoring of medical representatives activities. Regional delegates can access a lists of reports for specific representatives and apply sorts and filters to it.
fr: GSB-RV-DR est une application de bureau conçue pour les délégués régionaux de l'entreprise fictive GSB. Elle permet de suivre les rapports de visite et de monitorer les activités des délégués médicaux. Les délégués régionaux peuvent accéder à la liste des rapports et y appliquer des filtres ou les trier.

# credit
source: Design inspired by
fr: Design inspiré par
